### Pandas - DataFrame and Series

In [23]:
import pandas as pd

### Series

In [24]:
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
# Create a series from dictionary element
data = {
    "a" : 1,
    "b" : 2,
    "c" : 3,
    "d" : 4
}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [26]:
data = [1,2,3,4,5]
index = ["A", "B", "C", "D", "E"]
series = pd.Series(data, index = index)
print(series)

A    1
B    2
C    3
D    4
E    5
dtype: int64

### DataFrame

In [27]:
# Create a Data Frame from a list of Dictionaries
data = [
    {'Name' : 'Aadarsh', 'Age' : 21, 'City' : 'Gopalganj'},
    {'Name' : 'Aniket', 'Age' : 23, 'City' : 'Patna'},
    {'Name' : 'Ritesh', 'Age' : 23, 'City' : 'Chhapra'}
]
df = pd.DataFrame(data, index = [1,2,3])
print(df)

      Name  Age       City
1  Aadarsh   21  Gopalganj
2   Aniket   23      Patna
3   Ritesh   23    Chhapra

In [28]:
# Retrieving data from a CSV file
data = pd.read_csv("Data.csv")
print(data.head(5))

  Series_reference   Period  Data_value  Suppressed STATUS    UNITS
0    BDCQ.SF1AA2CA  2016.09    1070.874         NaN      F  Dollars
1    BDCQ.SF1AA2CA  2016.12    1054.408         NaN      F  Dollars
2    BDCQ.SF1AA2CA  2017.03    1010.665         NaN      F  Dollars
3    BDCQ.SF1AA2CA  2017.06    1233.700         NaN      F  Dollars
4    BDCQ.SF1AA2CA  2017.09    1282.436         NaN      F  Dollars

In [29]:
# Accessing a specified element
data

  Series_reference   Period  Data_value  Suppressed STATUS    UNITS
0    BDCQ.SF1AA2CA  2016.09    1070.874         NaN      F  Dollars
1    BDCQ.SF1AA2CA  2016.12    1054.408         NaN      F  Dollars
2    BDCQ.SF1AA2CA  2017.03    1010.665         NaN      F  Dollars
3    BDCQ.SF1AA2CA  2017.06    1233.700         NaN      F  Dollars
4    BDCQ.SF1AA2CA  2017.09    1282.436         NaN      F  Dollars
5    BDCQ.SF1AA2CA  2017.12    1290.820         NaN      F  Dollars
6    BDCQ.SF1AA2CA  2018.03    1412.007         NaN      F  Dollars
7    BDCQ.SF1AA2CA  2018.06    1488.055         NaN      F  Dollars

In [30]:
print(data.at[3,'Period'])
print(data.iat[2,2])

2017.06
1010.665

In [33]:
# Adding a column
data['Luck'] = ['Yes','No','Yes','No','Yes','No','Yes','No']
print(data)

# Removing a column
data.drop('Luck', axis = 1, inplace = True)
print(data)

  Series_reference   Period  Data_value  Suppressed STATUS    UNITS Luck
0    BDCQ.SF1AA2CA  2016.09    1070.874         NaN      F  Dollars  Yes
1    BDCQ.SF1AA2CA  2016.12    1054.408         NaN      F  Dollars   No
2    BDCQ.SF1AA2CA  2017.03    1010.665         NaN      F  Dollars  Yes
3    BDCQ.SF1AA2CA  2017.06    1233.700         NaN      F  Dollars   No
4    BDCQ.SF1AA2CA  2017.09    1282.436         NaN      F  Dollars  Yes
5    BDCQ.SF1AA2CA  2017.12    1290.820         NaN      F  Dollars   No
6    BDCQ.SF1AA2CA  2018.03    1412.007         NaN      F  Dollars  Yes
7    BDCQ.SF1AA2CA  2018.06    1488.055         NaN      F  Dollars   No
  Series_reference   Period  Data_value  Suppressed STATUS    UNITS
0    BDCQ.SF1AA2CA  2016.09    1070.874         NaN      F  Dollars
1    BDCQ.SF1AA2CA  2016.12    1054.408         NaN      F  Dollars
2    BDCQ.SF1AA2CA  2017.03    1010.665         NaN      F  Dollars
3    BDCQ.SF1AA2CA  2017.06    1233.700         NaN      F  Dollars
4    BDCQ.SF1AA2CA  2017.09    1282.436         NaN      F  Dollars
5    BDCQ.SF1AA2CA  2017.12    1290.820         NaN      F  Dollars
6    BDCQ.SF1AA2CA  2018.03    1412.007         NaN      F  Dollars
7    BDCQ.SF1AA2CA  2018.06    1488.055         NaN      F  Dollars

In [34]:
data['Period'] = data['Period'] + 100
data

  Series_reference   Period  Data_value  Suppressed STATUS    UNITS
0    BDCQ.SF1AA2CA  2116.09    1070.874         NaN      F  Dollars
1    BDCQ.SF1AA2CA  2116.12    1054.408         NaN      F  Dollars
2    BDCQ.SF1AA2CA  2117.03    1010.665         NaN      F  Dollars
3    BDCQ.SF1AA2CA  2117.06    1233.700         NaN      F  Dollars
4    BDCQ.SF1AA2CA  2117.09    1282.436         NaN      F  Dollars
5    BDCQ.SF1AA2CA  2117.12    1290.820         NaN      F  Dollars
6    BDCQ.SF1AA2CA  2118.03    1412.007         NaN      F  Dollars
7    BDCQ.SF1AA2CA  2118.06    1488.055         NaN      F  Dollars

In [ ]:
# Statistical details
data.describe()

            Period   Data_value  Suppressed
count     5.000000     5.000000         0.0
mean   2117.454000  1285.372600         NaN
std       0.540028   183.888127         NaN
min    2117.030000  1010.665000         NaN
25%    2117.060000  1233.700000         NaN
50%    2117.090000  1282.436000         NaN
75%    2118.030000  1412.007000         NaN
max    2118.060000  1488.055000         NaN